packages/tusk-depgraph/Miniriot.dot
digraph Miniriot {
  "20" [label="process.mli", color="blue", style="filled", fillcolor="lightblue"];
  "2" [label="mailbox.ml", color="green", style="filled", fillcolor="lightgreen"];
  "7" [label="proc_effect.ml", color="green", style="filled", fillcolor="lightgreen"];
  "0" [label="aliases.ml.gen", color="green", style="filled", fillcolor="lightgreen"];
  "10" [label="trace.ml", color="green", style="filled", fillcolor="lightgreen"];
  "5" [label="mailbox.mli", color="blue", style="filled", fillcolor="lightblue"];
  "22" [label="pid.ml", color="green", style="filled", fillcolor="lightgreen"];
  "6" [label="miniriot.ml", color="green", style="filled", fillcolor="lightgreen"];
  "17" [label="miniriot.mli", color="blue", style="filled", fillcolor="lightblue"];
  "19" [label="pid.mli", color="blue", style="filled", fillcolor="lightblue"];
  "13" [label="proc_state.mli", color="blue", style="filled", fillcolor="lightblue"];
  "9" [label="trace.mli", color="blue", style="filled", fillcolor="lightblue"];
  "11" [label="effects.ml", color="green", style="filled", fillcolor="lightgreen"];
  "21" [label="message.mli", color="blue", style="filled", fillcolor="lightblue"];
  "16" [label="message.ml", color="green", style="filled", fillcolor="lightgreen"];
  "3" [label="runtime.mli", color="blue", style="filled", fillcolor="lightblue"];
  "1" [label="process.ml", color="green", style="filled", fillcolor="lightgreen"];
  "8" [label="scheduler.ml", color="green", style="filled", fillcolor="lightgreen"];
  "12" [label="scheduler.mli", color="blue", style="filled", fillcolor="lightblue"];
  "15" [label="effects.mli", color="blue", style="filled", fillcolor="lightblue"];
  "14" [label="runtime.ml", color="green", style="filled", fillcolor="lightgreen"];
  "4" [label="proc_effect.mli", color="blue", style="filled", fillcolor="lightblue"];
  "18" [label="proc_state.ml", color="green", style="filled", fillcolor="lightgreen"];

  "20" -> "0";
  "2" -> "0";
  "7" -> "0";
  "10" -> "0";
  "5" -> "0";
  "22" -> "0";
  "6" -> "0";
  "17" -> "0";
  "19" -> "0";
  "13" -> "0";
  "9" -> "0";
  "11" -> "0";
  "21" -> "0";
  "16" -> "0";
  "3" -> "0";
  "1" -> "0";
  "8" -> "0";
  "12" -> "0";
  "15" -> "0";
  "14" -> "0";
  "4" -> "0";
  "18" -> "0";}
